#Вариант 2. Среднее значение.
#Предназначен для вычисления среднего значения 3-х чисел.

#Все данные - числа типа float
print("Вы сейчас введёте числа для определения среднего значения.")
x = float(input("Введите первое число (х): "))
y = float(input("Введите второе число (y): "))
z = float(input("Введите третье число (z): "))

#Формула взята из справочника, однако в зависимости от кол-ва переменных число "3" может меняться.
#Делитель зависит от кол-ва слогаемых в числителе.
result = round((x + y + z) / 3, 2)

#Команда вывода. Используется "f", чтоб print мог определить переменную
print(f"Среднее значение чисел: {result}")